---
kind: method
id: M:Autodesk.Revit.DB.Structure.Hub.GetOrigin
source: html/8f1e05fc-5c77-1279-f278-448b8e8d7958.htm
---
# Autodesk.Revit.DB.Structure.Hub.GetOrigin Method

Retrieves position of a Hub if such position is a 3D point.

## Syntax (C#)
```csharp
public XYZ GetOrigin()
```

## Returns
The origin.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - Hub does not have an Origin.